package render

import (
	"fmt"

	"github.com/lemconn/foxflow/internal/utils"
)

// RenderBanner 渲染启动横幅（右下角显示版本）
func RenderBanner(version string) string {

	lines := `
================================================================
  ███████╗ ██████╗ ██╗  ██╗███████╗██╗      ██████╗ ██╗    ██╗
  ██╔════╝██╔═══██╗╚██╗██╔╝██╔════╝██║     ██╔═══██╗██║    ██║
  █████╗  ██║   ██║ ╚███╔╝ █████╗  ██║     ██║   ██║██║ █╗ ██║
  ██╔══╝  ██║   ██║ ██╔██╗ ██╔══╝  ██║     ██║   ██║██║███╗██║
  ██║     ╚██████╔╝██╔╝ ██╗██║     ███████╗╚██████╔╝╚███╔███╔╝
  ╚═╝      ╚═════╝ ╚═╝  ╚═╝╚═╝     ╚══════╝ ╚═════╝  ╚══╝╚══╝
                                               version: %s
  %s
================================================================
`

	return fmt.Sprintf(lines, utils.MessageGreen(version), utils.MessageBlue("欢迎使用 FoxFlow 策略下单系统"))
}
